
//Задание 1
Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты";
	Запрос.УстановитьПараметр("Организация", Справочники.Организации.ПустаяСсылка());
	
	Если Запрос.Количество() > 0 Тогда
		Сообщить("Найдено контрагентов:"+Запрос.Количество);
		Выборка = Запрос.Выполнить().Выбрать();		
		Пока Выборка.Следующий() Цикл		
			Объект = Выборка.Ссылка;
			Объект.ПометкаУдаления = Истина;
			Объект.Записать(РежимЗаписиДокумента.Запись)		
		КонецЦикла;
	КонецЕсли;

//Задание 2
Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
               |	Рейс.Перевозчик,
               |	Рейс.Автомобиль,
               |	Рейс.Водитель,
               |	Рейс.Ссылка КАК Рейс
               |ИЗ
               |	Документ.Рейс КАК Рейс
               |ГДЕ
               |	Рейс.Дата МЕЖДУ &ДатаНач И &ДатаКон
               |;
               |
               |////////////////////////////////////////////////////////////////////////////////
               |ВЫБРАТЬ
               |	РейсЗаказыНаДоставку.ЗаказНаДоставку
               |ИЗ
               |	Документ.Рейс.ЗаказыНаДоставку КАК РейсЗаказыНаДоставку
               |ГДЕ
               |	РейсЗаказыНаДоставку.Ссылка.Номер = &НомерРейса";
Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
Запрос.УстановитьПараметр("НомерРейса", "00012378");
Выборка = Запрос.Выполнить().Выбрать();
	
ТЗ = Новый ТаблицаЗначений;
ТЗ.Колонки.Добавить(«Перевозчик»);
ТЗ.Колонки.Добавить(«Автомобиль»);
ТЗ.Колонки.Добавить(«Водитель»);
Пока Выборка[0].Следующий() Цикл
	Если НЕ Выборка.Рейс.ПометкаУдаления Тогда
		НС = ТЗ.Добавить();
		НС.Перевозчик = Выборка.Перевозчик;
		НС.Автомобиль = Выборка.Автомобиль;
		НС.Водитель = Выборка.Водитель;
	КонецЕсли;
КонецЦикла;
ТЗ.Свернуть("Перевозчик,Автомобиль,Водитель");

ТекстСообщения = "Рейс 00012378 доставил груз в города: ");
Пока Выборка[1].Следующий() Цикл
ТекстСообщения = ТекстСообщения + «, » + Выборка.ЗаказНаДоставку.Грузополучатель.Город.Наименоввание;
КонецЦикла;
Сообщить(ТекстСообщения);
